InformationRegisters/ИсторияИзмененияСтатусовЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИзмененияСтатусовЗаказов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтправленныеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОтправленныеСообщения</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Адресат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСМС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЭкспортированныеОбъектыВИСПеревозчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЭкспортированныеОбъектыВИСПеревозчиков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Перевозчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПунктОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПунктДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыОтпарвленныхОбъектовВИСПеревозчика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбратнаяДоставкаПолучена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыСписанияОстаткаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыСписанияОстаткаТоваров</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СоСклада</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзРезерва</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийРКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРКО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПокупателю</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймамСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствПодотчетнику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствКассеККМ</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаличнымиВБанк</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходДенежныхСредствПрочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлатыПоВедомостям</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлатыРаботнику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассацияДенежныхСредств</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийВозвратТоваровОтПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийВозвратТоваровОтПокупателя</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПродажаКомиссия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПоступленияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПоступленияТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСклад</Name>
					<Comment>(Общ) Поступление на склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОрдеру</Name>
					<Comment>(Упр) Поступление по приходному ордеру</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ОбщийМодульПодписокНаСобытия/Ext/Module.bsl
Процедура ИзменениСтатусаЗаказаПриЗаписи(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Источник.ОбменДанными.Загрузка = Истина ИЛИ Не ЗначениеЗаполнено(Источник.СтатусЗаказа) Тогда
		Возврат;
	КонецЕсли;
		
	//возврат товаров
	Если Источник.СтатусЗаказа.ФормироватьВозвратТоваров И Источник.НеУчитыватьВОтчете = Ложь Тогда
		СоздатьВозвратТоваров(Источник.Ссылка);
	КонецЕсли;
	
	//вн перемещение
	Если Источник.СтатусЗаказа.ФормироватьВнПеремещение И ЗначениеЗаполнено(Источник.СтатусЗаказа.КассаВнПеремещения) Тогда
		СоздатьВнПеремещение(Источник.Ссылка);
	КонецЕсли;
	
	// ВНИМАНИЕ: флаг называется "Закрывать резерв", но здесь исторически вызывается
	// создание внутреннего перемещения (похоже на копипасту ветки выше), а обёртка
	// ЗакрытьРезерв() -> ЗакрытиеЗаказа() не вызывается ниоткуда.
	// Поведение НЕ меняем: только фиксируем факт срабатывания в журнале регистрации.
	Если Источник.СтатусЗаказа.ЗакрыватьРезерв  Тогда
		ЛогСтатуса(Источник, "ЗакрыватьРезерв_ВызовВнПеремещения");
		СоздатьВнПеремещение(Источник.Ссылка);
	КонецЕсли;

	
	ПоследнееЗначение = РегистрыСведений.ИсторияИзмененияСтатусовЗаказов.ПолучитьПоследнее(,Новый Структура("ЗаказПокупателя",Источник.Ссылка));
	Если ПоследнееЗначение.СтатусЗаказа <> Источник.СтатусЗаказа Тогда
		МенеджерЗаписи = РегистрыСведений.ИсторияИзмененияСтатусовЗаказов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДата();
		МенеджерЗаписи.ЗаказПокупателя = Источник.Ссылка;
		МенеджерЗаписи.СтатусЗаказа = Источник.СтатусЗаказа;
		МенеджерЗаписи.Записать();
		
		Если Источник.НеОтправлятьСообщение <> Истина
			 И (Источник.СтатусЗаказа.ОтправлятьСМСПриУстановке 
			 ИЛИ Источник.СтатусЗаказа.ОтправлятьСМСПоШаблону)
			 И Источник.СтатусЗаказа.ПредыдущиеСтатусыУсловиеОтправкиСМС.Найти(ПоследнееЗначение.СтатусЗаказа)<>Неопределено 
			Тогда
			ОтправкаСМСУведомленияПокупателю(Источник.Ссылка);
		КонецЕсли;
		
		Если Источник.ДополнительныеСвойства.Свойство("ЭтоНовый") И Источник.ДополнительныеСвойства.ЭтоНовый = Истина 
																	И Источник.СтатусЗаказа.ОтправлятьСМСПоШаблону Тогда  //СМС для Нового
			ОтправкаСМСУведомленияПокупателю(Источник.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	//Если НЕ Источник.ИзРеализации Тогда
	Заказ = Источник.Ссылка;
	СтатусЗаказаПоследний = РегистрыСведений.ИсторияИзмененияСтатусовЗаказов.ПолучитьПоследнее(,Новый Структура("ЗаказПокупателя",Заказ)).СтатусЗаказа;
	Если Источник.СтатусЗаказа.ФормироватьРеализацию И Источник.НеУчитыватьВОтчете = Ложь  Тогда
		Если НЕ РеализацияЕсть(Источник.Ссылка) Тогда
			РН = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			РН.Заполнить(Источник.Ссылка);
			РН.Товары.Загрузить(Источник.Товары.Выгрузить());
			РН.ОтражатьВБухгалтерскомУчете = Ложь;
			РН.Дата = ТекущаяДата();
			Для каждого ТекСтрТЧ Из РН.Товары Цикл
				ТекСтрТЧ.ЗаказПокупателя = Источник.Ссылка;
				ТекСтрТЧ.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.ИзРезерва;
			КонецЦикла;
			Попытка
				РН.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ЛогОшибкиСтатуса(Источник, "ИзменениСтатусаЗаказаПриЗаписи_РН", ОписаниеОшибки());
				РН.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				//РН.Записать(РежимЗаписиДокумента.Запись);
			КонецПопытки;
		КонецЕсли;
	Иначе
		
		Если Источник.ДополнительныеСвойства.Свойство("ОтменитьРеализацию") И Источник.ДополнительныеСвойства.ОтменитьРеализацию = Истина  Тогда
		
			Запрос = новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РеализацияТоваровУслуг.Ссылка
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|ГДЕ
			|	РеализацияТоваровУслуг.Сделка = &Сделка И РеализацияТоваровУслуг.Проведен";
			Запрос.УстановитьПараметр("Сделка", Источник.Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока выборка.Следующий() Цикл
				РН = выборка.Ссылка.Получитьобъект();
				РН.ПометкаУдаления = Истина;
				РН.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	
	//Открывать Маркет Плэйс

	РозницаПлатформа = Источник.МожноОткрытьМаркетПлэйст();
	Если Источник.СтатусЗаказа.ОткрыватьМаркетПлэйс И РозницаПлатформа
		И Источник.СтатусЗаказа = СтатусЗаказаПоследний Тогда
		// Ветка ниже практически недостижима: СтатусЗаказаПоследний читается уже ПОСЛЕ
		// записи истории статусов, поэтому всегда равен текущему статусу.
		// Логируем, чтобы подтвердить это по фактическим данным.
		// Просто "починить" условие нельзя: ОткрытьМаркетПлэйс() использует COMОбъект
		// и ЗапуститьПриложение, это клиентский код и на сервере он упадёт.
		ЛогСтатуса(Источник, "МаркетПлэйс_НеОткрыт", "текущий статус равен последнему в истории");
	КонецЕсли;

	Если Источник.СтатусЗаказа.ОткрыватьМаркетПлэйс И РозницаПлатформа И Источник.СтатусЗаказа <> СтатусЗаказаПоследний Тогда 
		Источник.ОткрытьМаркетПлэйс();	
		Сообщить("Нужно изменить статус заказа на маркетплэйс");			
	КонецЕсли;
				

	НайденПКО = НайтиПКО(Источник.Ссылка);
	НайденППО = НайтиППО(Источник.Ссылка);
    СуммаНоваяПочта = Источник.Ссылка.СуммаНоваяПочта; 
	Попытка 
		ЭтоОпт = Источник.ТипЦен.ПолучитьОбъект().ЭтоОптоваяЦена();
	Исключение  
		ЭтоОпт = Ложь;
	КонецПопытки; 
	
	Если Источник.Контрагент.ПолучитьОбъект().ЭтоОптовик() Тогда  
		 СуммаНоваяПочта = СуммаНоваяПочта - Источник.ДваПроцентаУслуга;
	КонецЕсли;
	
	ОстаткиРезервов = Документы.ЗаказПокупателя.РезервПоЗаказуОстаток(Источник.Ссылка);
		
	КонтрольОплаты = Справочники.ЛМ_ВидыОбратнойДоставки.НайтиПоКоду("000000012");
	Наложка = Справочники.ЛМ_ВидыОбратнойДоставки.НайтиПоКоду("000000009");

	
	//ПКО
	Если Источник.СтатусЗаказа.ФормироватьПКО И Источник.НеУчитыватьВОтчете = Ложь Тогда
		//Если НЕ ОплатаЕсть(Источник.Ссылка) Тогда

					
			ТипОбратнойДоставки = Источник.Ссылка.ТипОбратнойДоставки;		
						
			Если СуммаНоваяПочта <> 0 И  ЗначениеЗаполнено(ТипОбратнойДоставки) Тогда
				Если ТипОбратнойДоставки = Наложка Тогда 					
				
					Если ОстаткиРезервов.Количество() > 0 ИЛИ
						Источник.СтатусЗаказа.Наименование <> "Ожидает отправки" и Источник.НомерТТН = ""
						Тогда
						Если ЗначениеЗаполнено(НайденПКО) Тогда
							ПКО = НайденПКО.ПолучитьОбъект();
							ПКО.Записать(РежимЗаписиДокумента.ОтменаПроведения);
							ПКО.ПометкаУдаления = Истина;
							ПКО.Записать();
						КонецЕсли;
						
						Сообщить("Есть не закрытый резерв Приходный ордер не создан или отмене");
						// Возврат ниже выходит из ВСЕГО обработчика, а не только из блока ПКО:
						// ФормироватьВозвратДенег в конце процедуры не выполнится.
						ЛогСтатуса(Источник, "ВыходИзОбработчика", "незакрытый резерв, ПКО (наложка); ФормироватьВозвратДенег пропущен");
						Возврат;
					КонецЕсли;
										
					Если ЗначениеЗаполнено(НайденПКО) Тогда
						
						ПКО = НайденПКО.ПолучитьОбъект();
						
						Если НЕ ПКО.проведен ИЛИ 
							 ПКО.СуммаДокумента <> СуммаНоваяПочта
							 Тогда                                        
							ПКО.ПометкаУдаления = Ложь;
							ПКО.Записать(РежимЗаписиДокумента.ОтменаПроведения);
							ПКО.СуммаДокумента = СуммаНоваяПочта ;
							ПКО.РасшифровкаПлатежа[0].СуммаВзаиморасчетов = СуммаНоваяПочта;
							ПКО.РасшифровкаПлатежа[0].СуммаПлатежа = СуммаНоваяПочта;
							ПКО.Комментарий = "";

							Попытка
							ПКО.Записать(РежимЗаписиДокумента.Проведение);
							Исключение
							ЛогОшибкиСтатуса(Источник, "ИзменениСтатусаЗаказаПриЗаписи_ПКО", ОписаниеОшибки());
							ПКО.Записать(РежимЗаписиДокумента.Запись);
						КонецПопытки;
					КонецЕсли;
					Иначе
						ПКО = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();							
						ПКО.Дата = ТекущаяДата() + (60*60*24);
						Сум = СуммаНоваяПочта; // ; ?(,Источник.Ссылка.СуммаДокумента,Источник.Ссылка.СуммаНоваяПочта);
						ПКОСсылка = ПКО.НаОснованииЗаказаПокупателя(Источник.Ссылка,Сум,Источник.СтатусЗаказа.Касса);
					    ПКО.ДокументОснование = Источник;
						Попытка
						ПКО.Записать(РежимЗаписиДокумента.Проведение);
						Исключение
						ЛогОшибкиСтатуса(Источник, "ИзменениСтатусаЗаказаПриЗаписи_ПКО", ОписаниеОшибки());
						ПКО.Записать(РежимЗаписиДокумента.Запись);
						КонецПопытки;
					КонецЕсли;
					
				ИначеЕсли ТипОбратнойДоставки = КонтрольОплаты Тогда
					
					 Если ((ОстаткиРезервов.Количество() > 0 И Источник.СтатусЗаказа.Наименование <> "Завершенные") ИЛИ 		
						(Источник.СтатусЗаказа.Наименование <> "Ожидает отправки" и Источник.НомерТТН = "") ИЛИ 
						Не ЗначениеЗаполнено(Источник.БанковскийСчетКонтрольОплаты)) И НЕ Источник.СпособОтправки.Код = "000000006" 
						Тогда
						Если ЗначениеЗаполнено(НайденППО) Тогда
							ППО = НайденППО.ПолучитьОбъект();
							ППО.Записать(РежимЗаписиДокумента.ОтменаПроведения);
							ППО.ПометкаУдаления = Истина;
							ППО.Комментарий = "Отмена 2  " + ТекущаяДата() + " " + ОстаткиРезервов.Количество() + " " + Источник.СтатусЗаказа.Наименование + " " + Источник.НомерТТН + " " + Источник.БанковскийСчетКонтрольОплаты;			

							ППО.Записать();
						КонецЕсли;
						
						Сообщить("Есть не закрытый резерв Платежное поручение входящее не создано или отменено");
						// Возврат ниже выходит из ВСЕГО обработчика, а не только из блока ППО:
						// ФормироватьВозвратДенег в конце процедуры не выполнится.
						ЛогСтатуса(Источник, "ВыходИзОбработчика", "незакрытый резерв, ППО (контроль оплаты); ФормироватьВозвратДенег пропущен");
						Возврат;
					КонецЕсли;	
					
					Если ЗначениеЗаполнено(НайденППО) Тогда
						
						ППО = НайденППО.ПолучитьОбъект();

						Если НЕ ППО.проведен ИЛИ 
							 ППО.СуммаДокумента <> СуммаНоваяПочта
							 Тогда
						
							ППО.ПометкаУдаления = Ложь;
							ППО.Записать(РежимЗаписиДокумента.ОтменаПроведения);
							ППО.СуммаДокумента = СуммаНоваяПочта;
							ППО.РасшифровкаПлатежа[0].СуммаВзаиморасчетов =СуммаНоваяПочта;
							ППО.РасшифровкаПлатежа[0].СуммаПлатежа =СуммаНоваяПочта;
							ППО.Комментарий = "";
							Попытка
								ППО.Записать(РежимЗаписиДокумента.Проведение);
							Исключение
								ЛогОшибкиСтатуса(Источник, "ИзменениСтатусаЗаказаПриЗаписи_ППО", ОписаниеОшибки());
								ППО.Записать(РежимЗаписиДокумента.Запись);
							КонецПопытки;
						КонецЕсли;

					Иначе
						//ППО = Документы.ПлатежноеПоручениеВходящее.СоздатьДокумент();							
						//ППО.Дата = ТекущаяДата() + (60*60*24);
						
						Сум = СуммаНоваяПочта; // ; ?(,Источник.Ссылка.СуммаДокумента,Источник.Ссылка.СуммаНоваяПочта);

						ППО =Документы.ПлатежноеПоручениеВходящее.СоздатьДок(Источник.Ссылка,Сум,Источник.Ссылка.БанковскийСчетКонтрольОплаты);
	         		  	ППО.НазначениеПлатежа = "Наложка";
						//ПКОСсылка = ППО.НаОснованииЗаказаПокупателя(Источник.Ссылка,Сум,Источник.СтатусЗаказа.Касса)
						Попытка
						ППО.Записать(РежимЗаписиДокумента.Проведение);
						Исключение
						ЛогОшибкиСтатуса(Источник, "ИзменениСтатусаЗаказаПриЗаписи_ППО", ОписаниеОшибки());
						ППО.Записать(РежимЗаписиДокумента.Запись);
						КонецПопытки;
					КонецЕсли;
					
					
										
                   Если ЗначениеЗаполнено(НайденПКО) И НайденПКО.Проведен Тогда    
						
						Попытка
							
					//		Ответ = Вопрос("Найден ПКО. Отменить проведение документа?", РежимДиалогаВопрос.ДаНет);
					//
					//		Если Ответ = КодВозвратаДиалога.Да Тогда
						        ПКО = НайденПКО.ПолучитьОбъект();
                                ПКО.Комментарий = "Отменен так как есть платежное поручение";     
								ПКО.Записать(РежимЗаписиДокумента.ОтменаПроведения); 
							//КонецЕсли;
						
						Исключение 
							ЛогОшибкиСтатуса(Источник, "ИзменениСтатусаЗаказаПриЗаписи_ПКО_ПодавленнаяОшибка", ОписаниеОшибки());
						//	ЗаписьЖурналаРегистрации(ОписаниеОшибки() + " ПКО "  + НайденПКО.Номер, УровеньЖурналаРегистрации.Ошибка);	
						КонецПопытки;
		
					КонецЕсли;


					
					
					
					
					
					
					
				ИначеЕсли ЗначениеЗаполнено(НайденПКО) Тогда
					
					Если Источник.СтатусЗаказа.Наименование = "Ожидает отправки" Тогда
						ЛогСтатуса(Источник, "ВыходИзОбработчика", "статус 'Ожидает отправки', найден ПКО; ФормироватьВозвратДенег пропущен");
						Возврат;
					КонецЕсли;
					
					ПКО = НайденПКО.ПолучитьОбъект();
					ПКО.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					ПКО.ПометкаУдаления = Истина;
					ПКО.Записать();
					Сообщить("Приходный кассовый документ отменен!!" + ПКО);
					
				ИначеЕсли ЗначениеЗаполнено(НайденППО) Тогда
					Если Источник.СтатусЗаказа.Наименование = "Ожидает отправки" Тогда
						ЛогСтатуса(Источник, "ВыходИзОбработчика", "статус 'Ожидает отправки', найдено ППО; ФормироватьВозвратДенег пропущен");
						Возврат;
					КонецЕсли;
					
					ППО = НайденППО.ПолучитьОбъект();
					ППО.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					ППО.ПометкаУдаления = Истина;
					ППО.Комментарий = "Отмена 3";

					ППО.Записать();
					Сообщить("Платежное Поручение отменено!!" + ППО);		
				КонецЕсли;
			Иначе
			
				Если ЗначениеЗаполнено(НайденПКО) И
					 Источник.СтатусЗаказа.Наименование = "Ожидает отправки" 
				Тогда
					ПКО = НайденПКО.ПолучитьОбъект();
					ПКО.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					ПКО.ПометкаУдаления = Истина;
					ПКО.Записать();
					Сообщить("Приходный кассовый документ отменен!!" + ПКО);
				ИначеЕсли ЗначениеЗаполнено(НайденППО) И
					 Источник.СтатусЗаказа.Наименование = "Ожидает отправки" Тогда
					 
					ППО = НайденППО.ПолучитьОбъект();
					ППО.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					ППО.ПометкаУдаления = Истина;
					ППО.Комментарий = "Отмена 4";

					ППО.Записать();
					Сообщить("Платежное Поручение отменено!!" + ППО);
					
				КонецЕсли;
			КонецЕсли;
				

			
	Иначе 
		Если ЗначениеЗаполнено(НайденПКО) Тогда
			ПКО = НайденПКО.ПолучитьОбъект();
			ПКО.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			ПКО.ПометкаУдаления = Истина;
			ПКО.Записать();
			Сообщить("Приходный кассовый документ отменен!!" + ПКО);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НайденППО) Тогда
			ППО = НайденППО.ПолучитьОбъект();
			ППО.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			ППО.ПометкаУдаления = Истина;
			ППО.Комментарий = "Отмена 1";

			ППО.Записать();
			Сообщить("Платежное поручение входящее отменено!!" + ППО);
		КонецЕсли;					

		
	КонецЕсли;
	
	Если Источник.СтатусЗаказа.ФормироватьВозвратДенег И Источник.НеУчитыватьВОтчете = Ложь Тогда
		СоздатьВозвратДенег(Источник.Ссылка); 
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура СоздатьВнПеремещение(Заказ)
	Если Заказ.Дата<= Дата(2019,01,04) Тогда
		Возврат;
	КонецЕсли;
	
	//проверка на вхождение в статус из
	ПоследнееЗначение = РегистрыСведений.ИсторияИзмененияСтатусовЗаказов.ПолучитьПоследнее(,Новый Структура("ЗаказПокупателя",Заказ));
	Если Заказ.СтатусЗаказа.ПредыдущиеСтатусыУсловиеОтправкиСМС.Найти(ПоследнееЗначение.СтатусЗаказа)=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтрольОплаты = Справочники.ЛМ_ВидыОбратнойДоставки.НайтиПоКоду("000000012");			
	ТипОбратнойДоставки = Заказ.ТипОбратнойДоставки;

	Если КонтрольОплаты = ТипОбратнойДоставки Тогда
		Возврат;
	КонецЕсли;


	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВнутреннееПеремещениеНаличныхДенежныхСредств.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ВнутреннееПеремещениеНаличныхДенежныхСредств КАК ВнутреннееПеремещениеНаличныхДенежныхСредств
	               |ГДЕ
	               |	ВнутреннееПеремещениеНаличныхДенежныхСредств.Основание = &Основание
	               |	И НЕ ВнутреннееПеремещениеНаличныхДенежныхСредств.ПометкаУдаления";
	Запрос.УстановитьПараметр("Основание",Заказ);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда 
		Если Рез.Ссылка.СуммаДокумента = Заказ.СуммаНоваяПочта И Рез.Ссылка.Проведен Тогда
			Возврат;
		КонецЕсли;
		Док = Рез.Ссылка.ПолучитьОбъект();
	Иначе
		Док = Документы.ВнутреннееПеремещениеНаличныхДенежныхСредств.СоздатьДокумент();
		Задача = Задачи.ЗадачиПользователя.СоздатьЗадачу();
		//Задача.ос
		Док.Дата = ТекущаяДата();
	КонецЕсли;
	
	Док.Касса = Справочники.Кассы.НайтиПоКоду("000000020");
	Док.КассаПолучатель = Заказ.СтатусЗаказа.КассаВнПеремещения;
	Док.ОрганизацияОтправитель = Заказ.Организация;
	Док.ОрганизацияПолучатель = Заказ.Организация;
	Док.Оплачено = Истина;
	Док.Основание = Заказ;
	Док.СуммаДокумента = Заказ.СуммаНоваяПочта;
	Док.ВалютаДокумента = Заказ.ВалютаДокумента;
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ЛогОшибкиСтатуса(Заказ, "СоздатьВнПеремещение_Док", ОписаниеОшибки());
		ФД = Док.ПолучитьФорму("ФормаДокумента");
		ФД.Открыть();
	КонецПопытки;
	
КонецПроцедуры

процедура ЗакрытьРезерв(Заказ) 
	Заказ.ПолучитьОбъект().ЗакрытиеЗаказа();	
КонецПроцедуры


Процедура СоздатьВозвратДенег(Заказ)
	
	Если Заказ.Дата<= Дата(2017,12,05) Тогда
		Возврат;
	КонецЕсли;
	
	
	КонтрольОплаты = Справочники.ЛМ_ВидыОбратнойДоставки.НайтиПоКоду("000000012");
	Наложка = Справочники.ЛМ_ВидыОбратнойДоставки.НайтиПоКоду("000000009");
	ТипОбратнойДоставки = Заказ.ТипОбратнойДоставки;

	Если ТипОбратнойДоставки = КонтрольОплаты Тогда
		ППО = НайтиППО(Заказ).ПолучитьОбъект();
		ППО.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ППО.ПометкаУдаления = Истина;
		ППО.Комментарий = "Отмена 4";
		ППО.Записать();
		Возврат;
	КонецЕсли;

	//НайтиППО(Сделка)
	
	//проверка на вхождение в статус из
	ПоследнееЗначение = РегистрыСведений.ИсторияИзмененияСтатусовЗаказов.ПолучитьПоследнее(,Новый Структура("ЗаказПокупателя",Заказ));
	Если Заказ.СтатусЗаказа.ПредыдущиеСтатусыУсловиеОтправкиСМС.Найти(ПоследнееЗначение.СтатусЗаказа)=Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка
	               |ИЗ
	               |	Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасходныйКассовыйОрдерРасшифровкаПлатежа
	               |ГДЕ
	               |	РасходныйКассовыйОрдерРасшифровкаПлатежа.Сделка = &Сделка";
	Запрос.УстановитьПараметр("Сделка",Заказ);			   
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда 
		Сум = ?(Заказ.СуммаНоваяПочта =0,Заказ.СуммаДокумента,Заказ.СуммаНоваяПочта);

		Если Рез.Ссылка.СуммаДокумента = Сум И Рез.Ссылка.Проведен Тогда
			Возврат;
		КонецЕсли;

		Док = Рез.Ссылка.ПолучитьОбъект();
	Иначе
		Док = Документы.РасходныйКассовыйОрдер.СоздатьДокумент();
		НайденПКО = НайтиПКО(Заказ);
		Если ЗначениеЗаполнено(НайденПКО) Тогда
			Док.Дата = ТекущаяДата();
			//Док.Дата = НайденПКО.Дата+5;
		Иначе
			Док.Дата = ТекущаяДата();
		КонецЕсли;
	КонецЕсли;
	
	Док.ОтражатьВУправленческомУчете = Истина;
	Док.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Док.Организация = Справочники.Организации.НайтиПоКоду("000000001");
	Док.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("980");
	Док.Оплачено = Истина;
	Док.Комментарий = "Возврат денег";
				
	Док.Касса = Справочники.Кассы.НайтиПоКоду("000000001");

	Если НЕ ЗначениеЗаполнено(Док.Касса) Тогда	
		Док.Касса = Док.Организация.ОсновнаяКасса;
	КонецЕсли;

	Док.ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателю;
	Док.Контрагент = Заказ.Контрагент;
	Дог =  Заказ.ДоговорКонтрагента;
	Сум = ?(Заказ.СуммаНоваяПочта =0,Заказ.СуммаДокумента,Заказ.СуммаНоваяПочта);
	Док.РасшифровкаПлатежа.Очистить();
	РП = Док.РасшифровкаПлатежа.Добавить();
	РП.КратностьВзаиморасчетов = 1;
	РП.КурсВзаиморасчетов = 1;
	РП.СуммаПлатежа = Сум;
	РП.Сделка  = Заказ;
	РП.СуммаВзаиморасчетов = РП.СуммаПлатежа;
	РП.ДоговорКонтрагента = Дог;
	
	Док.СуммаДокумента = Сум;
	Док.Контрагент = Заказ.Контрагент;

	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ЛогОшибкиСтатуса(Заказ, "СоздатьВозвратДенег_Док", ОписаниеОшибки());
		//ФД = Док.ПолучитьФорму("ФормаДокумента");
		//ФД.Открыть();
		Док.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	
КонецПроцедуры

Процедура СоздатьВозвратТоваров(Заказ)
	
	КонтрольОплаты = Справочники.ЛМ_ВидыОбратнойДоставки.НайтиПоКоду("000000012");
	Наложка = Справочники.ЛМ_ВидыОбратнойДоставки.НайтиПоКоду("000000009");
	ТипОбратнойДоставки = Заказ.ТипОбратнойДоставки;
	НайденППВ = НайтиППО(Заказ.Ссылка);	
	
	Если Заказ.Дата<= Дата(2017,12,05) Тогда
		Возврат;
	КонецЕсли;
	
	// В отличие от СоздатьВнПеремещение и СоздатьВозвратДенег здесь НЕ проверяется
	// таблица "ПредыдущиеСтатусыУсловиеОтправкиСМС": возврат формируется при любой
	// записи заказа в статусе с флагом, а не только при переходе из разрешённого статуса.
	// Поведение НЕ меняем: логируем, попал бы предыдущий статус в таблицу или нет.
	ПредыдущийСтатусДиагностика = РегистрыСведений.ИсторияИзмененияСтатусовЗаказов.ПолучитьПоследнее(,Новый Структура("ЗаказПокупателя",Заказ)).СтатусЗаказа;
	ЛогСтатуса(Заказ, "ВозвратТоваров_БезПроверкиПредыдущегоСтатуса",
		"предыдущий статус: " + СокрЛП(ПредыдущийСтатусДиагностика)
		+ "; в таблице разрешённых переходов: "
		+ ?(Заказ.СтатусЗаказа.ПредыдущиеСтатусыУсловиеОтправкиСМС.Найти(ПредыдущийСтатусДиагностика) = Неопределено, "нет", "да"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВозвратТоваровОтПокупателя.Ссылка
	               |ИЗ
	               |	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	               |ГДЕ
	               |	ВозвратТоваровОтПокупателя.Сделка = &Сделка";
	Запрос.УстановитьПараметр("Сделка",Заказ);
	Рез = Запрос.Выполнить().Выбрать();
	
	ОстаткиРезервов = Документы.ЗаказПокупателя.РезервПоЗаказуОстаток(Заказ);
	
	Если Заказ.СуммаДокумента = 0 Тогда 
			//Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			//Док.Комментарий = "Сумма заказа 0";
			//Док.Записать(РежимЗаписиДокумента.Запись);
			Возврат; 
	КонецЕсли;
	
	Если ОстаткиРезервов.Количество() > 0 Тогда
		//Если Рез.Следующий() Тогда 
		//	Док = Рез.Ссылка.ПолучитьОбъект();
		//	Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		//	Док.Комментарий = "Есть не закрытый резерв";
		//	Док.Записать(РежимЗаписиДокумента.Запись);
		//	Сообщить("Есть не закрытый резерв");
		//КонецЕсли;
		Возврат;
	КонецЕсли;

	
	Если Рез.Следующий() Тогда
		//Если Рез.Ссылка.СуммаДокумента = Заказ.СуммаДокумента И Рез.Ссылка.Проведен Тогда
		//	Возврат;
		//КонецЕсли;
		Док = Рез.Ссылка.ПолучитьОбъект();
	Иначе
		Док = Документы.ВозвратТоваровОтПокупателя.СоздатьДокумент();
		Док.Дата = ТекущаяДата();
	КонецЕсли;
	//Заказ=Документы.ЗаказПокупателя.СоздатьДокумент();
	
	Док.ОтражатьВУправленческомУчете = Истина;
	Док.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Док.Организация = Справочники.Организации.НайтиПоКоду("000000001");
	Док.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("980");
	Док.Комментарий = "Возврат товара" + Док.Дата;
	Док.КурсВзаиморасчетов = 1;
	Док.НеВозвращатьРезерв = Истина;
	Док.ТипЦен = Заказ.ТипЦен;
	Док.КратностьВзаиморасчетов = 1;
	Док.ВидОперации = Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.ПродажаКомиссия;
	Док.Контрагент = Заказ.Контрагент;
	Док.ДоговорКонтрагента = Заказ.ДоговорКонтрагента;
	Док.СуммаДокумента = Заказ.СуммаДокумента;
	
	Если Заказ.СтатусЗаказа = Справочники.СтатусыЗаказов.НайтиПоНаименованию("На возврате") Тогда
		Док.СкладОрдер = Справочники.Склады.НайтиПоКоду("000000126");
	ИначеЕсли Заказ.СтатусЗаказа = Справочники.СтатусыЗаказов.НайтиПоНаименованию("Отказ") Тогда 
		Если Док.СкладОрдер = Справочники.Склады.НайтиПоКоду("000000126") Тогда
			Док.СкладОрдер = Справочники.Склады.НайтиПоКоду("000000014");
		КонецЕсли;
	КонецЕсли;
	 
	//Док.СкладОрдер = Заказ.СкладГруппа;
	Док.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
	Док.Сделка = Заказ;
	
	Док.Товары.Очистить();
	Для Каждого Стр Из Заказ.Товары Цикл
		НС = Док.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Стр);
		НС.Качество = Справочники.Качество.Новый;
		НС.Склад = Заказ.СкладГруппа;
		Если Не ЗначениеЗаполнено(НС.Склад) Тогда
			НС.Склад  = Справочники.Склады.НайтиПоКоду("000000002");
		КонецЕсли;
	КонецЦикла;

	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ЛогОшибкиСтатуса(Заказ, "СоздатьВозвратТоваров_Док", ОписаниеОшибки());
		//ФД = Док.ПолучитьФорму("ФормаДокумента");
		//ФД.Открыть();
		Док.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;

КонецПроцедуры

Функция ОплатаЕсть (Заказ) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	               |ГДЕ
	               |	НЕ ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.ПометкаУдаления
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сделка = &Сделка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка
	               |ИЗ
	               |	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеВходящееРасшифровкаПлатежа
	               |ГДЕ
	               |	НЕ ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.ПометкаУдаления
	               |	И ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Сделка = &Сделка";
				   
	Запрос.УстановитьПараметр("Сделка",Заказ);
	Рез = Запрос.Выполнить().Выгрузить();
	
	Если Рез.Количество()>0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция РеализацияЕсть (Заказ) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслуг.Ссылка
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Сделка = &Сделка";
				   
	Запрос.УстановитьПараметр("Сделка",Заказ);
	Рез = Запрос.Выполнить().Выгрузить();
	
	Если Рез.Количество()>0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ШаблонСМСВТекст(ВыбТекст,ЗаказПокупателя)  Экспорт
	
	ВыбТекст = СтрЗаменить(ВыбТекст, "[НомерТТН]", ЗаказПокупателя.НомерТТН);
	
	ВыбТекст = СтрЗаменить(ВыбТекст, "[СкладНовойПочты]", ЗаказПокупателя.СкладНовойПочтыЗначение.Наименование);
			
	ВыбТекст = СтрЗаменить(ВыбТекст, "[Сумма]", Формат(ЗаказПокупателя.Товары.Итог("Сумма")+ЗаказПокупателя.Услуги.Итог("Сумма"), "ЧДЦ=0"));
	
	ВыбТекст = СтрЗаменить(ВыбТекст,"[ДатаДоставки]",Формат(ЗаказПокупателя.ДатаДоставки,"ДФ=dd.MM.yyyy"));
	ВыбТекст = СтрЗаменить(ВыбТекст,"[НомерЗаказа2]",СокрЛП(ЗаказПокупателя.НомерЗаказа2ССайта));
	ВыбТекст = СтрЗаменить(ВыбТекст,"[Получатель]",СокрЛП(ЗаказПокупателя.Получатель));

	Если ЗначениеЗаполнено(ЗаказПокупателя.СуммаНоваяПочта) <> 0 Тогда
	   ВыбТекст = СтрЗаменить(ВыбТекст, "[Наложка]", "Післяплата " + Формат(ЗаказПокупателя.СуммаНоваяПочта, "ЧДЦ=0") + " Грн");
   	Иначе
	   ВыбТекст = СтрЗаменить(ВыбТекст, "[Наложка]","");
   	КонецЕсли;
   
	Если ЗначениеЗаполнено(ЗаказПокупателя.НомерЗаказа2ССайта) Тогда 	
		ВыбТекст = СтрЗаменить(ВыбТекст,"[НомерЗаказа]",СокрЛП(ЗаказПокупателя.НомерЗаказа2ССайта));
	Иначе	                                           
		ВыбТекст = СтрЗаменить(ВыбТекст,"[НомерЗаказа]",УбратьНоликиСлева(ЗаказПокупателя.Номер));
	КонецЕсли;

	Возврат ВыбТекст;	
КонецФункции

Функция УбратьНоликиСлева(СтрокаСНоликами) Экспорт 
	Ф=0;  НоваяСтрока = "";
	Для Сч = 1 По СтрДлина(СтрокаСНоликами) Цикл 
		Символ = Сред(СтрокаСНоликами,Сч,1);
		Если  НЕ Символ = "0" и Ф=0 Тогда
			//первый ненулевой символ
			Ф=1
		КонецЕсли;
		Если Ф=1 Тогда
			//дальше берем все и нолики тоже
			НоваяСтрока = НоваяСтрока+Символ
		КонецЕсли;
	КонецЦикла;
	Возврат НоваяСтрока
КонецФункции

Функция ДополнитьНомерНулями(СтрокаНомера,ДлинаНомера)     Экспорт
 Номер = "";
 Для Сч = 1 По СтрДлина(СтрокаНомера) Цикл
	Симв = Сред(СтрокаНомера,Сч,1); 
	Если Симв <> " " Тогда  //уберем разделитель триад
		Номер = Номер+Симв;
	КонецЕсли;
КонецЦикла;
Для Сч = 1 По ДлинаНомера-СтрДлина(Номер) Цикл
	 Номер = "0"+Номер;
КонецЦикла;
Возврат Номер
КонецФункции

Функция ШаблонОтправили(ЗаказПокупателя) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =   "ВЫБРАТЬ
	                |	ОтправленныеСообщения.Текст
	                |ИЗ
	                |	РегистрСведений.ОтправленныеСообщения КАК ОтправленныеСообщения
	                |ГДЕ
	                |	ОтправленныеСообщения.Шаблон = &Шаблон
	                |	И ОтправленныеСообщения.Заказ = &Заказ";
	Запрос.УстановитьПараметр("Заказ",ЗаказПокупателя);
	Запрос.УстановитьПараметр("Шаблон",ЗаказПокупателя.СтатусЗаказа.ШаблонСМС);
	
	Рез  = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество()>0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция НайтиПКО(Сделка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	               |ГДЕ
	               |	(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сделка = &Сделка
	               |			ИЛИ ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.ДокументОснование = &Сделка)
				   |     И (ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Касса = &Касса 
				   |			Или ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Касса = &Касса1)";
				   
	Запрос.УстановитьПараметр("Сделка",Сделка);
	Запрос.УстановитьПараметр("Касса",Справочники.Кассы.НайтиПоКоду("000000001"));
	Запрос.УстановитьПараметр("Касса1",Справочники.Кассы.НайтиПоКоду("000000020"));
	Рез = Запрос.Выполнить().Выгрузить();
	
	Если Рез.Количество()>0 Тогда
		Возврат Рез[0].Ссылка;
	Иначе
		Возврат Документы.ПриходныйКассовыйОрдер.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция НайтиППО(Сделка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеВходящееРасшифровкаПлатежа
	               |ГДЕ
	               |	(ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Сделка = &Сделка
	               |			ИЛИ ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.ДокументОснование = &Сделка)
	               |	И ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.НазначениеПлатежа ПОДОБНО &НазначениеПлатежа";
				   
	Запрос.УстановитьПараметр("Сделка",Сделка);
	Запрос.УстановитьПараметр("НазначениеПлатежа", "Наложка");
	Рез = Запрос.Выполнить().Выгрузить();
	
	Если Рез.Количество()>0 Тогда
		Возврат Рез[0].Ссылка;
	Иначе
		Возврат Документы.ПлатежноеПоручениеВходящее.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Процедура ОтправкаСМСУведомленияПокупателю(ЗаказПокупателя) Экспорт
	ОтправлятьСМС = Константы.РассылкаТТНСПомощьюСМС.Получить();
	ОтправлятьЭлПисьма = Константы.РассылкаТТНСПомощьюЭлПочты.Получить();
	
	Если (ОтправлятьСМС ИЛИ ОтправлятьЭлПисьма) И ЗаказПокупателя.Контрагент.Родитель.ОтправлятьСМС Тогда
		
		Если ЗаказПокупателя.СтатусЗаказа.ОтправлятьСМСПоШаблону И ЗначениеЗаполнено(ЗаказПокупателя.СтатусЗаказа.ШаблонСМС) Тогда
			
					
				ВыбТекст = СокрЛП(ЗаказПокупателя.СтатусЗаказа.ШаблонСМС.Текст); //отправка смс по шаблону!
				ВыбТекст = ШаблонСМСВТекст(ВыбТекст,ЗаказПокупателя);
				Если ЗаказПокупателя.Контрагент.Родитель.СМСПоОсновномуТелефону 
					 ИЛИ ЗаказПокупателя.Контрагент.Родитель.СМСПоОсновномуТелефону 
					 ИЛИ ЗаказПокупателя.Контрагент.Родитель.Родитель.СМСПоОсновномуТелефону
					Тогда					
					ВыбНомер = ОбщегоНазначения.ТелефонКонтрагента(ЗаказПокупателя.Контрагент);
				Иначе
					ВыбНомер = ПолучитьНомерТелефонаКонтрагента(ЗаказПокупателя.Контрагент);
				КонецЕсли;
				
				Если СокрЛП(ВыбНомер) = "" Тогда
					ВыбНомер = ПолучитьНомерТелефонаКонтрагента(ЗаказПокупателя.Контрагент);
				КонецЕсли;
				
				// попытка №5
				Если СокрЛП(ВыбНомер) = "" Тогда
					ВыбНомер = ЗаказПокупателя.ТелефонКонтрагента;
				КонецЕсли;
				
				ОбщегоНазначения.ПоправитьТелефон(ВыбНомер);
				
				Если НЕ ЗначениеЗаполнено(ВыбНомер)  И ОтправлятьСМС   Тогда
					#Если Клиент Тогда
						Сообщить("Не указан номер телефона покупателя " + ЗаказПокупателя.Контрагент + ". SMS не отправлена.");
					#КонецЕсли
					//Возврат;
					ОтправлятьСМС = Ложь;
				КонецЕсли;
				
				// проверим отправляли мы уже этот шаблон или нет
				ШаблонОтправлен = ШаблонОтправили(ЗаказПокупателя);
				
				Если ШаблонОтправлен Тогда
					//ОтправлятьСМС = Ложь;
					//ОтправлятьЭлПисьма = ложь;
				Иначе
					МенеджерЗаписи = РегистрыСведений.ОтправленныеСообщения.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Период = ТекущаяДата();
					МенеджерЗаписи.Заказ = ЗаказПокупателя;
					МенеджерЗаписи.Шаблон = ЗаказПокупателя.СтатусЗаказа.ШаблонСМС;
					МенеджерЗаписи.Текст = ВыбТекст;
					МенеджерЗаписи.Телефон = ВыбНомер;
					МенеджерЗаписи.Записать();
				КонецЕсли;

			
				Если ОтправлятьЭлПисьма И ЗначениеЗаполнено(ЗаказПокупателя.АдресЭлектроннойПочтыКонтрагента) Тогда
					УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлПочты.Получить();
					УправлениеЭлектроннойПочтой.ОтправитьПисьмо1(УчетнаяЗапись,ВыбТекст,ЗаказПокупателя.АдресЭлектроннойПочтыКонтрагента,СокрЛП(ЗаказПокупателя));
				ИначеЕсли ОтправлятьСМС Тогда
					ИмяВходящегоФайла = "" + КаталогВременныхФайлов() + "outsms.txt";
					Текст = Новый ТекстовыйДокумент();
					login = Константы.ЛогинСМС.Получить();
					password = Константы.ПарольСМС.Получить();
					
					from = СокрЛП(ЗаказПокупателя.АльфаИмя.Наименование);
					
					Сервер = "www.smpp.smsclub.mobi";
					СтрокаПараметраПолучения = "/hfw_smpp_addon/httpsendsms.php?username=" + login + "&password=" + password; 
					СтрокаПолучения = СтрокаПараметраПолучения + "&from=" + from + "&to=" + СокрЛП(ВыбНомер) + "&text=" + Строка(base64_encode(СокрЛП(ВыбТекст)));
					
					ЗапросHTTP(СтрокаПолучения, Сервер, ИмяВходящегоФайла, Текст, ВыбНомер);
 				КонецЕсли;
				Возврат; 
			КонецЕсли; 
		
		МенеджерЗаписи = РегистрыСведений.ЭкспортированныеОбъектыВИСПеревозчиков.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект = ЗаказПокупателя;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			
			Если Не ПроверитьНомерТТН(МенеджерЗаписи.НомерДокумента) Тогда
				#Если Клиент Тогда
					Сообщить("При экспорте документа " + ЗаказПокупателя + " в Новую почту был получен некорректный номер ТТН. Сообщение не отправлено.");
				#КонецЕсли
				Возврат;
			КонецЕсли;
			
			ВыбНомер = ПолучитьНомерТелефонаКонтрагента(ЗаказПокупателя.Контрагент);
			Если ВыбНомер = Неопределено И ОтправлятьСМС Тогда
				#Если Клиент Тогда
					Сообщить("Не указан номер телефона покупателя " + ЗаказПокупателя.Контрагент + ". SMS не отправлена.");
				#КонецЕсли
				//Возврат;
				ОтправлятьСМС = Ложь;
			КонецЕсли;
			
			//ВыбТекст = "Ваш номер для получения посылки " + МенеджерЗаписи.НомерДокумента + ". Благодарим за покупку";
			ВыбТекст = Константы.ШаблонСообщения.Получить();
			ВыбТекст = СтрЗаменить(ВыбТекст, "[НомерТТН]", Строка(МенеджерЗаписи.НомерДокумента));
			
			// АА+ при отправке автоматом СМС отсылается тольком номер заказа2 при заполненном номере заказа1  
			ВыбТекст = СтрЗаменить(ВыбТекст, "[Сумма]", Формат(ЗаказПокупателя.Товары.Итог("Сумма"), "ЧДЦ=0"));
			ВыбТекст = СтрЗаменить(ВыбТекст,"[ДатаДоставки]",Формат(ЗаказПокупателя.ДатаДоставки,"ДФ=dd.MM.yyyy"));

			//ВыбТекст = СтрЗаменить(ВыбТекст,"[НомерЗаказа2]",
			//	?(ЗначениеЗаполнено(ЗаказПокупателя.НомерЗаказа2ССайта),"заказ на сайте №","")+СокрЛП(ЗаказПокупателя.НомерЗаказа2ССайта));
			//Если ЗначениеЗаполнено(ЗаказПокупателя.НомерЗаказа2ССайта) Тогда 	
			//	ВыбТекст = СтрЗаменить(ВыбТекст,"[НомерЗаказа]","");
			//Иначе	
			//	ВыбТекст = СтрЗаменить(ВыбТекст,"[НомерЗаказа]","заказ №"+СокрЛП(Формат(Число(ОбщийМодульПодписокНаСобытия.УдалитьВСтрокеВсеКромеЦифр(ЗаказПокупателя.Номер)),"ЧЦ=15; ЧРГ=''")));
			//КонецЕсли;
			ВыбТекст = СтрЗаменить(ВыбТекст,"[НомерЗаказа2]",СокрЛП(ЗаказПокупателя.НомерЗаказа2ССайта));
			Если ЗначениеЗаполнено(ЗаказПокупателя.НомерЗаказа2ССайта) Тогда 	
				ВыбТекст = СтрЗаменить(ВыбТекст,"[НомерЗаказа]","");
			Иначе	
				ВыбТекст = СтрЗаменить(ВыбТекст,"[НомерЗаказа]",СокрЛП(Формат(Число(ОбщийМодульПодписокНаСобытия.УдалитьВСтрокеВсеКромеЦифр(ЗаказПокупателя.Номер)),"ЧЦ=15; ЧРГ=''")));
			КонецЕсли;
			// [НомерЗаказа][НомерЗаказа2][НомерТТН][Сумма]
			// АА-
			
			Если ОтправлятьЭлПисьма И ЗначениеЗаполнено(ЗаказПокупателя.АдресЭлектроннойПочтыКонтрагента) Тогда
				УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлПочты.Получить();
				УправлениеЭлектроннойПочтой.ОтправитьПисьмо(УчетнаяЗапись, ВыбТекст, ЗаказПокупателя.АдресЭлектроннойПочтыКонтрагента);
			ИначеЕсли ОтправлятьСМС Тогда
				ИмяВходящегоФайла = "" + КаталогВременныхФайлов() + "outsms.txt";
				Текст = Новый ТекстовыйДокумент();
				login = Константы.ЛогинСМС.Получить();
				password = Константы.ПарольСМС.Получить();
				
				Если ЗначениеЗаполнено(ЗаказПокупателя.АльфаИмя) Тогда
					from = СокрЛП(ЗаказПокупателя.АльфаИмя.Наименование);
				Иначе
					Альфаимя = АльфаИмяПоУмолчанию();
					from = СокрЛП(АльфаИмя.Наименование);
				КонецЕсли;
				
				Сервер = "www.smpp.smsclub.mobi";
				СтрокаПараметраПолучения = "/hfw_smpp_addon/httpsendsms.php?username=" + login + "&password=" + password; 
				СтрокаПолучения = СтрокаПараметраПолучения + "&from=" + from + "&to=" + СокрЛП(ВыбНомер) + "&text=" + Строка(base64_encode(СокрЛП(ВыбТекст)));
				
				ЗапросHTTP(СтрокаПолучения, Сервер, ИмяВходящегоФайла, Текст, ВыбНомер);
			КонецЕсли;
			
		Иначе
			#Если Клиент Тогда
				Сообщить("Документ " + ЗаказПокупателя + " не экспортировался в новую почту. Сообщение не отправлено.");
			#КонецЕсли
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Процедура ОтправкаСМСУведомленияОтдельно(ЗаказПокупателя,Текст,Телефон) Экспорт
	Если СокрЛП(Текст) = "" Тогда Возврат; КонецЕсли;
	Если СокрЛП(Телефон) = "" Тогда Возврат; КонецЕсли;
	ОтправлятьСМС = Константы.РассылкаТТНСПомощьюСМС.Получить();
	ВыбТекст = ШаблонСМСВТекст(Текст,ЗаказПокупателя);	
	ВыбНомер = Телефон;
	Если ОтправлятьСМС Тогда
		
		ИмяВходящегоФайла = "" + КаталогВременныхФайлов() + "outsms.txt";
		Текст = Новый ТекстовыйДокумент();
		login = Константы.ЛогинСМС.Получить();
		password = Константы.ПарольСМС.Получить();
		
		from = СокрЛП(ЗаказПокупателя.АльфаИмя.Наименование);
		
		Сервер = "www.smpp.smsclub.mobi";
		СтрокаПараметраПолучения = "/hfw_smpp_addon/httpsendsms.php?username=" + login + "&password=" + password; 
		СтрокаПолучения = СтрокаПараметраПолучения + "&from=" + from + "&to=" + СокрЛП(ВыбНомер) + "&text=" + Строка(base64_encode(СокрЛП(ВыбТекст)));
		Попытка
			ЗапросHTTP(СтрокаПолучения, Сервер, ИмяВходящегоФайла, Текст, ВыбНомер);
		Исключение
			Сообщить("Не удалось отправить СМС по заказу "+СокрЛП(ЗаказПокупателя));
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Функция АльфаИмяПоУмолчанию()Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АльфаИмена.Ссылка
	               |ИЗ
	               |	Справочник.АльфаИмена КАК АльфаИмена
	               |ГДЕ
	               |	НЕ АльфаИмена.ПометкаУдаления
	               |	И АльфаИмена.ПоУмолчанию";
				   
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.ССылка;
	Иначе
		Возврат Справочники.АльфаИмена.ПустаяСсылка();
	КонецЕсли;
КонецФункции

// АА+
Функция УдалитьВСтрокеВсеКромеЦифр(СтрокаПроверки) Экспорт
	НЧ = "";
	ДЛя Сч =1 По СтрДлина(СтрокаПроверки) Цикл
		СимволПроверки = Сред(СтрокаПроверки,Сч,1);
		если СимволПроверки = "1" Или СимволПроверки = "2" Или СимволПроверки = "3" Или СимволПроверки = "4" Или СимволПроверки = "5" Или СимволПроверки = "," Или СимволПроверки = "."
			Или СимволПроверки = "6" Или СимволПроверки = "7"  Или СимволПроверки = "8" Или СимволПроверки = "9" Или СимволПроверки = "0" Тогда
			НЧ = НЧ+СимволПроверки;
		КонецЕсли;
	КонецЦикла;
	Возврат НЧ;

	
	//RegExp = Новый COMОбъект("VBScript.RegExp");
	//RegExp.IgnoreCase = Истина; //Игнорировать регистр 
	//RegExp.Global = Истина; //Поиск всех вхождений шаблона 
	//RegExp.MultiLine = Истина; //Многострочный режим 
	//RegExp.Pattern = "[^0-9]"; // отбор только чисел
	//стр=RegExp.Replace(стр, ""); 
	////Сообщить(стр);   
	//Возврат стр;
КонецФункции	
// АА-

Функция base64_encode(Стр) Экспорт 
	
	ИмяФайла = "sms.txt"; 
	КаталогВременныхФайлов = КаталогВременныхФайлов();

	
	ФайлSMS = Новый ЗаписьТекста(КаталогВременныхФайлов+ИмяФайла, КодировкаТекста.ANSI);
	ФайлSMS.Записать(СокрЛП(Стр));
	ФайлSMS.Закрыть();

	ФайлДвоичныеДанные = Новый ДвоичныеДанные(КаталогВременныхФайлов+ИмяФайла);
	Возврат Base64Строка(ФайлДвоичныеДанные);
		
КонецФункции

Функция ДатаISO8601(Д) Экспорт 
	Возврат "" + Формат(Год(Д), "ЧГ=0") + "-" + Формат(Месяц(Д), "ЧЦ=2; ЧВН=") + "-" + Формат(День(Д), "ЧЦ=2; ЧВН=") + "T" + 
			Формат(Час(Д), "ЧЦ=2; ЧВН=") + ":" + Формат(Минута(Д), "ЧЦ=2; ЧВН=") + ":" + Формат(Секунда(Д), "ЧЦ=2; ЧВН=") + "+0200";
КонецФункции
		
Процедура ЗапросHTTP(СтрокаПолучения, Сервер, ИмяВходящегоФайла, Текст, ВыбНомер) Экспорт
	Попытка
		Соединение = Новый HTTPСоединение(Сервер,,,);
		Соединение.Получить(СтрокаПолучения, ИмяВходящегоФайла,);
		ВходящийФайл = Новый Файл(ИмяВходящегоФайла);
		Если НЕ ВходящийФайл.Существует() Тогда
			Сообщить("Не удалось получить ответ с сервера"); 
			Возврат;
		КонецЕсли;
		Сообщить("SMS отправлена.");
		Возврат;
		ВыбСтатус = "";
		Текст.Прочитать(ИмяВходящегоФайла, КодировкаТекста.UTF8);
		КолСтрок = Текст.КоличествоСтрок();
		Для Инд = 1 По КолСтрок Цикл
			Стр = Текст.ПолучитьСтроку(Инд);
			ВыбСтатус = ВыбСтатус + Стр + Символы.ПС;
			Сообщить(Стр);
			Если Лев(Стр, 8) = "balance:" Тогда
				Стр = СтрЗаменить(Стр, "balance:", "");
				ВыбБаланс = Число(Стр);
			ИначеЕсли Лев(Стр, 3) = "id:" Тогда
				Стр = СтрЗаменить(Стр, "id:", "");
				ВыбID = Число(Стр);
			ИначеЕсли Лев(Стр, 5) = "code:" Тогда
			КонецЕсли;
		КонецЦикла;
	Исключение
		Сообщить("Помилка: " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

Функция ПолучитьНомерТелефонаКонтрагента(Контрагент) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Контрагент;
	МенеджерЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	МенеджерЗаписи.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	МенеджерЗаписи.Прочитать();
	Если Не МенеджерЗаписи.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;
	ТекТелефонКонтрагента = МенеджерЗаписи.Представление;
	ТекТелефонКонтрагента = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефонКонтрагента);
	
	Возврат ТекТелефонКонтрагента;
	
КонецФункции

Функция ПроверитьНомерТТН(Знач НомерДокумента)
	
	Если ПустаяСтрока(НомерДокумента) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Итератор = 0 По 9 Цикл
		НомерДокумента = СтрЗаменить(НомерДокумента,СокрЛП(Итератор),"");
	КонецЦикла;
	
	Возврат ПустаяСтрока(НомерДокумента);

КонецФункции

// Читает из регистра сведений "КонтактнаяИнформация" актуальное значение телефона
// того же вида, что используется как "ОсновнойКонтакт" контрагента (Вид = ТелефонКонтрагента).
// Возвращает пустую строку, если телефон в регистре не заполнен/удалён.
//
Функция ПолучитьАктуальныйОсновнойТелефонКонтрагента(Знач Контрагент) Экспорт

	МенеджерЗаписи = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Контрагент;
	МенеджерЗаписи.Тип    = Перечисления.ТипыКонтактнойИнформации.Телефон;
	МенеджерЗаписи.Вид    = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	МенеджерЗаписи.Прочитать();

	Если Не МенеджерЗаписи.Выбран() Тогда
		Возврат "";
	КонецЕсли;

	Возврат СокрЛП(МенеджерЗаписи.Представление);

КонецФункции

// Обработчик подписки на событие "ПриЗаписи" регистра сведений "КонтактнаяИнформация".
// Синхронизирует кэширующий реквизит Контрагенты.ОсновнойКонтакт с фактическим
// значением телефона в регистре — иначе при очистке/удалении телефона в карточке
// контрагента реквизит ОсновнойКонтакт остаётся заполнен старым (уже неактуальным) значением.
//
Процедура СинхронизироватьОсновнойКонтактКонтрагентаПриЗаписиКИ(Источник, Отказ) Экспорт

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Объект = Источник.Отбор.Объект.Значение;

	Если Не ЗначениеЗаполнено(Объект)
		Или ТипЗнч(Объект) <> Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат;
	КонецЕсли;

	АктуальныйТелефон = ПолучитьАктуальныйОсновнойТелефонКонтрагента(Объект);

	Если Объект.ОсновнойКонтакт = АктуальныйТелефон Тогда
		Возврат;
	КонецЕсли;

	КонтрагентОбъект = Объект.ПолучитьОбъект();
	КонтрагентОбъект.ОсновнойКонтакт = АктуальныйТелефон;
	КонтрагентОбъект.Записать();

КонецПроцедуры

// Разовая обработка: приводит реквизит Контрагенты.ОсновнойКонтакт в соответствие
// с фактическим содержимым регистра "КонтактнаяИнформация" для контрагентов, у которых
// телефон в карточке был очищен/удалён ДО появления подписки
// "СинхронизироватьОсновнойКонтактКонтрагентаПриЗаписиКИ".
// Запускать один раз через "Вычислить выражение" в отладчике Конфигуратора:
//   ОбщийМодульПодписокНаСобытия.ОчиститьНеактуальныеОсновныеКонтактыКонтрагентов()
//
Процедура ОчиститьНеактуальныеОсновныеКонтактыКонтрагентов() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	ЗНАЧЕНИЕЗАПОЛНЕНО(Контрагенты.ОсновнойКонтакт)";

	Выборка = Запрос.Выполнить().Выбрать();
	КоличествоИсправлено = 0;

	Пока Выборка.Следующий() Цикл

		АктуальныйТелефон = ПолучитьАктуальныйОсновнойТелефонКонтрагента(Выборка.Ссылка);

		Если Выборка.Ссылка.ОсновнойКонтакт = АктуальныйТелефон Тогда
			Продолжить;
		КонецЕсли;

		КонтрагентОбъект = Выборка.Ссылка.ПолучитьОбъект();
		КонтрагентОбъект.ОсновнойКонтакт = АктуальныйТелефон;
		КонтрагентОбъект.Записать();

		КоличествоИсправлено = КоличествоИсправлено + 1;

	КонецЦикла;

	Сообщить("Исправлено контрагентов: " + КоличествоИсправлено);

КонецПроцедуры

// Проверка: сверяет Контрагенты.ОсновнойКонтакт с фактическим телефоном в регистре
// "КонтактнаяИнформация" и выводит список расхождений (если есть).
// Ничего не изменяет — только диагностика.
// Вызывать через "Вычислить выражение" в отладчике Конфигуратора:
//   ОбщийМодульПодписокНаСобытия.ПроверитьОсновныеКонтактыКонтрагентов()
// Результат = 0 значит расхождений не осталось.
//
Функция ПроверитьОсновныеКонтактыКонтрагентов() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	Контрагенты.ОсновнойКонтакт КАК ОсновнойКонтакт,
	|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК ТелефонВРегистре
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|	ПО  КонтактнаяИнформация.Объект = Контрагенты.Ссылка
	|	И   КонтактнаяИнформация.Тип    = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И   КонтактнаяИнформация.Вид    = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)
	|ГДЕ
	|	ЗНАЧЕНИЕЗАПОЛНЕНО(Контрагенты.ОсновнойКонтакт)
	|	И Контрагенты.ОсновнойКонтакт <> ЕСТЬNULL(КонтактнаяИнформация.Представление, """")";

	Выборка = Запрос.Выполнить().Выбрать();
	КоличествоРасхождений = 0;

	Пока Выборка.Следующий() Цикл

		КоличествоРасхождений = КоличествоРасхождений + 1;

		Сообщить(
			"Расхождение: " + Выборка.Контрагент
			+ " | ОсновнойКонтакт = '" + Выборка.ОсновнойКонтакт + "'"
			+ " | в регистре = '" + Выборка.ТелефонВРегистре + "'"
		);

	КонецЦикла;

	Если КоличествоРасхождений = 0 Тогда
		Сообщить("Расхождений не найдено, всё синхронизировано.");
	КонецЕсли;

	Возврат КоличествоРасхождений;

КонецФункции

// Запись в журнал регистрации ошибки, которая иначе подавляется блоком Исключение.
// ВАЖНО: намеренно не обращается к базе данных. После исключения внутри транзакции
// любое чтение из БД вызывает "В данной транзакции уже были ошибки", поэтому здесь
// нет ни представления ссылки, ни чтения реквизитов: только идентификатор заказа
// (не требует чтения) и текст ошибки.
// Логику заказа не меняет: существующее поведение обработчиков сохранено как было.
//
Процедура ЛогОшибкиСтатуса(Знач Заказ, Знач Событие, Знач ТекстОшибки)

	Попытка

		Идентификатор = "";
		Попытка
			Идентификатор = Строка(Заказ.Ссылка.УникальныйИдентификатор());
		Исключение
			// Идентификатор недоступен, пишем хотя бы текст ошибки.
		КонецПопытки;

		ЗаписьЖурналаРегистрации(
			"СтатусЗаказа." + Событие,
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.ЗаказПокупателя,
			,
			"Заказ (идентификатор): " + Идентификатор + "; ошибка: " + ТекстОшибки);

	Исключение
		// Диагностика не должна влиять на запись заказа.
	КонецПопытки;

КонецПроцедуры

// Диагностика подписки "ИзменениСтатусаЗаказа".
// Пишет в журнал регистрации факт срабатывания ветки обработчика.
// Логику заказа не меняет: нужна, чтобы по фактическим данным решить,
// какие настройки статуса реально работают, а какие нет.
// Смотреть: Журнал регистрации, отбор по событию, начинающемуся на "СтатусЗаказа."
//
Процедура ЛогСтатуса(Знач Заказ, Знач Событие, Знач Комментарий = "") Экспорт

	Попытка

		// Ссылка, а не объект: строковое преобразование объекта документа ненадёжно.
		ЗаказСсылка = Заказ.Ссылка;

		Текст = "Заказ: " + СокрЛП(ЗаказСсылка) + "; статус: " + СокрЛП(ЗаказСсылка.СтатусЗаказа);

		Если ЗначениеЗаполнено(Комментарий) Тогда
			Текст = Текст + "; " + СокрЛП(Комментарий);
		КонецЕсли;

		ЗаписьЖурналаРегистрации(
			"СтатусЗаказа." + Событие,
			УровеньЖурналаРегистрации.Информация,
			Метаданные.Документы.ЗаказПокупателя,
			ЗаказСсылка,
			Текст);

	Исключение
		// Диагностика не должна влиять на запись заказа.
	КонецПопытки;

КонецПроцедуры
